{
    "path": "Knowledge/conv.md",
    "name": "conv.md",
    "content": "---\ncreate: 2025-12-08T00:00:00.000Z\ntags:\n  - CNN\n---\n### Convolution in Convolutional Neural Networks (CNNs)\n\n**Convolution** is the core operation in Convolutional Neural Networks (CNNs) that allows the network to automatically learn spatial patterns (like edges, textures, and objects) from images or other grid-like data.\n\n- **How it works**:  \n  A small matrix called a **filter** (or **kernel**) slides over the input image (or previous feature map). At each position, the filter performs an **element-wise multiplication** with the overlapping patch of the input, then sums all the results to produce a single output value. This process is repeated across the entire input, creating a new 2D grid called a **feature map**.\n\n- **Key concepts**:\n  - **Parameters**: The filter is usually small (e.g., 3×3 or 5×5) and has learnable weights.\n  - **Stride**: How many pixels the filter moves at each step (stride=1 means moving one pixel at a time; stride=2 reduces the output size).\n  - **Padding**: Adding extra pixels (usually zeros) around the input to control the output size (e.g., \"same\" padding keeps the output size equal to the input).\n  - **Multiple filters**: A convolutional layer typically uses dozens or hundreds of different filters, each learning to detect a different feature.\n\n- **Mathematical view** (2D convolution):  \n  For an input image I and filter K, the output at position (i,j) is:  \n  O(i,j) = Σ Σ I(i+m, j+n) × K(m,n)  \n  where the sums are over the filter’s dimensions.\n\n- **Why it’s powerful**:\n  - **Parameter sharing**: The same filter is used across the whole image, drastically reducing the number of parameters compared to fully connected layers.\n  - **Local connectivity**: Each output neuron only looks at a small local region of the input, making it efficient for spatial hierarchies.\n  - **Translation invariance**: The same pattern is detected regardless of where it appears in the image.\n\nIn short, convolution enables CNNs to efficiently extract hierarchical features from raw pixel data, making them the foundation of modern computer vision."
}